/*
Определить класс с именем Student, содержащий следующие поля:
	фамилия и инициалы;
	номер группы;
	изучаемые предметы и соответствующие им оценки.
Определить методы доступа к этим полям и перегруженные операции
извлечения и вставки для объектов типа Student.
Заранее число объектов не известно.
Написать программу, выполняющую следующие действия:
	записи должны быть упорядочены по возрастанию среднего балла;
	вывод на дисплей фамилий и номеров групп для всех студентов,
имеющих хотя бы одну оценку 2;
	если таких студентов нет, вывести соответствующее сообщение.
*/
#pragma once
#include <iostream>


class Student
{
};

